# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "creativeprojects/tap"
tap "nahive/spotify-notify"

# CLI Tools
brew "awscli"
brew "coreutils"
brew "ctags"
brew "curl"
brew "duckdb"
brew "fzf"
brew "git-secret"
brew "go"
brew "gpg"
brew "grep"
brew "helm"
brew "httpie"
brew "jq"
brew "just"
brew "k9s"
brew "kubectx"
brew "lazygit"
brew "mas"
brew "maven"
brew "openconnect"
brew "openfortivpn"
brew "openvpn"
brew "parquet-cli"
brew "pdm"
brew "pipx"
brew "python"
brew "restic"
brew "resticprofile"
brew "sbt"
brew "scala"
brew "sheldon"
brew "sops"
brew "sqlite"
brew "tfenv"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "zsh-completions"
brew "zsh"

# Desktop applications
cask "arc"
cask "aws-vault"
cask "datagrip"
cask "handbrake"
cask "httpie"
cask "iterm2"
cask "messenger"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "numi"
cask "obsidian"
cask "orbstack"
cask "plex-media-server"
cask "poedit"
cask "powerphotos"
cask "session-manager-plugin"
cask "slack"
cask "spotify-notify"
cask "spotify"
cask "transmission"
cask "visual-studio-code"
cask "vlc"

# App store applications
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "XCode", id: 497799835
