# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "creativeprojects/tap"
tap "warrensbox/tap"
tap "homebrew/cask-fonts"

# CLI Tools
brew "awscli"
brew "coreutils"
brew "ctags"
brew "curl"
brew "duckdb"
brew "font-jetbrains-mono-nerd-font"
brew "fzf"
brew "git-secret"
brew "go"
brew "google-meet"
brew "gpg"
brew "grep"
brew "helm"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "eksctl"
brew "lazygit"
brew "mas"
brew "maven"
brew "meetingbar"
brew "parquet-cli"
brew "pipx"
brew "python"
brew "restic"
brew "resticprofile"
brew "sbt"
brew "scala"
brew "sheldon"
brew "sops"
brew "sqlite"
brew "tfswitch"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "yq"
brew "zsh-completions"
brew "zsh"

# Desktop applications
cask "1password"
cask "alcove"
cask "aws-vault"
cask "bruno"
cask "docker"
cask "ghostty"
cask "handbrake"
cask "klack"
cask "messenger"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "numi"
cask "obsidian"
cask "plex-media-server"
cask "poedit"
cask "powerphotos"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
cask "swish"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zen-browser"

# App store applications
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "XCode", id: 497799835
